05-Implementation/Backend/app/controllers/food_store_controller.rb

SELECT "food_stores".* FROM "food_stores"
---
     def index
          @foodstores = FoodStore.all