05-Implementation/Backend/app/controllers/user_controller.rb

     def create

       user = User.new
       user.food_store = FoodStore.find(params[:user][:foodstoreid])
       user.foodquality = params[:user][:foodquality]
       user.pricing = params[:user][:pricing]
       user.service = params[:user][:service]
       user.ambience = params[:user][:ambience]
       user.comment = params[:user][:comment]
       user.average = getAverage(user.foodquality,user.pricing,user.service,user.ambience)
       if user.save
---
SELECT  "food_stores".* FROM "food_stores" WHERE "food_stores"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "users" ("foodquality", "pricing", "service", "ambience", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["foodquality", 4], ["pricing", 5], ["service", 3], ["ambience", 4], ["comment", "dfadf"], ["created_at", "2018-02-17 13:18:12.899191"], ["updated_at", "2018-02-17 13:18:12.899191"]]

     def index
          # @foodstores = FoodStore.all
          @foodstores = FoodStore.find(params[:foodstoreid])
          # @foodstores = FoodStore.find(1)
          @ratings = User.where(food_store:@foodstores)
---
SELECT  "food_stores".* FROM "food_stores" WHERE "food_stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."food_store_id" IN (SELECT "food_stores"."id" FROM "food_stores")